//2020-07-23 星期四 中午休息时间 盈嘉互联 1008
//2020-07-23 星期五 早晨 林业楼小平房  
//for 循环最灵活，
//作业，用for循环求出100到200之间所有的素数（只能被1和本身整除，如1，3，5，7这样的），并打印


#include <iostream>
using namespace std;

int main(){
	//案例1，for循环实现1+2+3..100=的累加
	//int x = 1, sum = 0;
	//for (x = 1; x <= 100; ++x) //小括号中的x = 1可以删除，但分号要保留
	//{
	//	sum += x;
	//}
	//cout << "1+2+3..100=" << sum << endl;

	//案例2，continue应用，计算1到100之间奇数相加的和
	int x = 1, sum = 0;
	for (x = 1; x <= 100; ++x) //小括号中的x = 1可以删除，但分号要保留
	{
		if (x % 2 == 0)
		{
			continue;  //当符合条件时跳出，从头再开始，不执行下一语句
		}
		sum += x;
	}
	cout << "1+3+5..100=" << sum << endl;
	return 0;
}